УправлениеВетеринарнойКлиникой/src/Documents/ЗаписьНаПрием/ЗаписьНаПрием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьНаПрием</name>
  <registerRecords>InformationRegister.РасписаниеВрачей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>В минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаписи</name>
    <type>
      <types>EnumRef.СтатусыЗаписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/InformationRegisters/РасписаниеВрачей/РасписаниеВрачей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеВрачей</name>
  <resources>
    <name>Занято</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Запись</name>
    <type>
      <types>DocumentRef.ЗаписьНаПрием</types>
    </type>
  </resources>
  <resources>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </resources>
  <dimensions>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеВетеринарнойКлиникой/src/Documents/ЗаписьНаПрием/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр РасписаниеВрачей
	Движения.РасписаниеВрачей.Записывать = Истина;
	Движение = Движения.РасписаниеВрачей.Добавить();
	Движение.Период = Дата;
	Движение.Врач = Врач;
	Движение.ДатаВремяНачала = ДатаВремяНачала;
	Движение.ДатаВремяОкончания = ДатаВремяНачала + (Продолжительность * 60);
	Движение.Услуга = Услуга;
	Движение.Запись = Ссылка;
	Движение.Питомец = Питомец;

КонецПроцедуры

#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ДатаВремяНачала) И ДатаВремяНачала < ТекущаяДатаСеанса() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата приёма не может быть меньше сегодняшней даты!";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "ДатаВремяНачала";
	КонецЕсли;
	
	Если Договор.ДатаНачала > ДатаВремяНачала ИЛИ Договор.ДатаОкончания < ДатаВремяНачала Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата приёма не совпадает с датой договора!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
#КонецОбласти
